src/cf/DataProcessors/РезультатыПроверкиПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РезультатыПроверкиПодписи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ПравилаПроверкиПолномочийПоМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПравилаПроверкиПолномочийПоМЧД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиПолномочийМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЖурналМашиночитаемыхДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналМашиночитаемыхДоверенностей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиныйРегистрационныйНомерДоверенности</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДоверители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеПредставители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СубъектыДоверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СубъектыДоверенности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоверительРук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительЮЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительЮЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НотариусФЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/МашиночитаемыеДоверенностиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МашиночитаемыеДоверенностиКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLфайлМЧД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания в ИБ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверительКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВРеестреФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоПредставителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозвана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолномочияОграничены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредставительИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместныеПолномочия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРеестреФНС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМашиночитаемойДоверенностиВРеестреФНС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиПроверкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПодпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителяРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСкриптПроверкиПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияПолномочий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаполненияПолномочийМЧД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставительИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/РезультатыПроверкиПодписи/Forms/ПроверкаПолномочийДоверенности/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не МашиночитаемыеДоверенности.ИмеетсяПравоИзмененияМЧД() Тогда
		ТекстСообщенияНедостаткаПрав = НСтр("ru = 'Недостаточно прав для ручной проверки полномочий.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияНедостаткаПрав);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЭтоОперацияЭДО", Ложь) Тогда
		Заголовок = НСтр("ru = 'Действие не выполнено'");
	Иначе
		Элементы.ДекорацияПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
	Параметры.Свойство("ПодписанныйОбъект", ПодписанныйОбъект);
	Параметры.Свойство("ХешПодписи", ХешПодписи);
	РезультатПроверки = МашиночитаемыеДоверенности.РезультатПроверкиПодписи(ПодписанныйОбъект, ХешПодписи);
	
	Если РезультатПроверки.ПротоколПроверки = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПроверкаМЧД = РезультатПроверки.ПротоколПроверки.ПроверкаМЧД;
	ПроверкаПолномочий = ПроверкаМЧД.ПроверкаПолномочий;
	ПроверкаРодительскихПолномочий = ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия;
	
	ПолучениеДанныхИзПротокола = ЗначениеЗаполнено(РезультатПроверки.Доверенность);
	
	Если ПолучениеДанныхИзПротокола Тогда
		Доверенность = РезультатПроверки.Доверенность;
		Если ПроверкаРодительскихПолномочий <> Неопределено Тогда
			НомерРодительскойДоверенности = ПроверкаРодительскихПолномочий.НомерДоверенности;
		КонецЕсли;
	Иначе
		Доверенность = Параметры.НоваяДоверенность;
		СвойстваДоверенности = МашиночитаемыеДоверенности.ОбщиеСвойстваДоверенности(Доверенность);
		НомерРодительскойДоверенности = СвойстваДоверенности.НомерРодительскойДоверенности;
	КонецЕсли;
	
	ЭтоПередоверие = ЗначениеЗаполнено(НомерРодительскойДоверенности);

	Если ЭтоПередоверие Тогда
		
		ПолномочияПодтверждены = ПроверкаПолномочий.Успех И ПроверкаПолномочий.РучнаяПроверка
			И ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия.Успех;
		
		ЗаполнитьЦепочкуДоверенностей();
		ЗаполнитьТабличныйДокументМЧД();
		
	Иначе
		
		ПолномочияПодтверждены = ПроверкаПолномочий.Успех И ПроверкаПолномочий.РучнаяПроверка;
		
		Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
			ПолномочияСтрокой = Справочники.МЧД003.ТекстПолномочий(Доверенность);
		Иначе
			ПолномочияСтрокой = МашиночитаемыеДоверенности.ТекстПолномочий(, Доверенность);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолномочияПодтверждены = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПредыдущееЗначениеПроверки = ПолномочияПодтверждены;
	
	Сообщение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодписанныйОбъект, "ВладелецФайла");
	ЭлектронныйДокумент = ЭлектронныеДокументыЭДО.ЭлектронныйДокументСообщенияЭДО(Сообщение);
	Подписи = ЭлектронныеДокументыЭДО.УстановленныеПодписиСУчетомДоверенностей(Сообщение);
	
	Для Каждого Подпись Из Подписи Цикл
		
		Если Подпись.СвойстваПодписи.ХешПодписи = ХешПодписи Тогда
			
			Сертификат = Подпись.СвойстваПодписи.Сертификат.Получить();
			Подписант = Подпись.СвойстваПодписи.Владелец;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстПричины = НСтр("ru = 'В документе не проверены полномочия доверенности'");
	
	Если ПустаяСтрока(Параметры.ТекстОшибки) Тогда
		
		Если НЕ ПолномочияПодтверждены Тогда
			
			ТекстОшибки = ПроверкаПолномочий.Ошибка;
			
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				ТекстПричины = ТекстОшибки;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстПричины = Параметры.ТекстОшибки;
		
	КонецЕсли;
	
	НастройкаВидимостиФормы(ЭтоПередоверие);
	
	Если Элементы.ДекорацияПредупреждение.Видимость Тогда
		
		ШаблонПредупреждения = НСтр("ru = 'Не удалось выполнить действие. %1.
			|Выполните ручную проверку и повторите действие.'");
		Элементы.ДекорацияПредупреждение.Заголовок = СтрШаблон(ШаблонПредупреждения, ТекстПричины);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭлектронныйДокументНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(, ЭлектронныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура СертификатНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АдресДанныхСертификата = АдресДанныхСертификата();
	
	Если АдресДанныхСертификата <> Неопределено Тогда
		ИнтеграцияБСПБЭДКлиент.ПоказатьСертификат(АдресДанныхСертификата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоверенности

&НаКлиенте
Процедура ДоверенностиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Доверенности.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Доверенность = Элементы.Доверенности.ТекущиеДанные.Доверенность;
	ПодключитьОбработчикОжидания("ЗаполнитьТабличныйДокументМЧДНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Принять(Команда)
	
	Если ПредыдущееЗначениеПроверки <> ПолномочияПодтверждены Тогда
		
		РезультатПроверки = Новый Структура();
		РезультатПроверки.Вставить("ПодписанныйОбъект", ПодписанныйОбъект);
		РезультатПроверки.Вставить("ХешПодписи", ХешПодписи);
		РезультатПроверки.Вставить("ПолномочияПодтверждены", ПолномочияПодтверждены);
		РезультатПроверки.Вставить("ТекстОшибки", "");
		РезультатПроверки.Вставить("НомерРодительскойДоверенности", НомерРодительскойДоверенности);
		
		Если ПредыдущееЗначениеПроверки = Истина И НЕ ПолномочияПодтверждены Тогда
			
			Оповещение = Новый ОписаниеОповещения(
				"ПослеУточненияПричиныНесоответствияПолномочий", ЭтотОбъект, РезультатПроверки);
			ОткрытьФорму("Обработка.РезультатыПроверкиПодписи.Форма.ВводПричиныНесоответствияПолномочий",,
				ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
		Иначе
			
			Закрыть(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатПроверки));
			
		КонецЕсли;
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаВидимостиФормы(ЭтоПередоверие)
		
	Элементы.ДекорацияЗаголовокПередоверия.Видимость = ЭтоПередоверие;
	Элементы.ГруппаПередоверия.Видимость = ЭтоПередоверие;
	Элементы.ПолномочияПередоверияПодтверждены.Видимость = ЭтоПередоверие;
	
	Элементы.ГруппаДеталиПроверки.ОтображатьЗаголовок = Не ЭтоПередоверие;
	Элементы.ГруппаДоверенность.Видимость = Не ЭтоПередоверие;
	Элементы.ПолномочияПодтверждены.Видимость = Не ЭтоПередоверие;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦепочкуДоверенностей()
	
	МассивНомеров = СтрРазделить(НомерРодительскойДоверенности, ",");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доверенности.Ссылка КАК Доверенность,
	|	Доверенности.НомерДоверенности,
	|	Доверенности.НомерРодительскойДоверенности,
	|	ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки КАК ПравилоПроверки,
	|	Доверенности.XMLфайлМЧД,
	|	Доверенности.ДатаВыдачи,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеДоверители,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеПредставители
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК Доверенности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
	|		ПО Доверенности.Ссылка = ПравилаПроверкиПолномочийПоМЧД.Доверенность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК ЖурналМашиночитаемыхДоверенностей
	|		ПО Доверенности.Ссылка = ЖурналМашиночитаемыхДоверенностей.Доверенность
	|ГДЕ
	|	Доверенности.НомерДоверенности В (&МассивНомеров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Доверенности.Ссылка КАК Доверенность,
	|	Доверенности.НомерДоверенности,
	|	Доверенности.НомерРодительскойДоверенности,
	|	ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки КАК ПравилоПроверки,
	|	Доверенности.XMLфайлМЧД,
	|	Доверенности.ДатаВыдачи,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеДоверители,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеПредставители
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК Доверенности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
	|		ПО Доверенности.Ссылка = ПравилаПроверкиПолномочийПоМЧД.Доверенность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК ЖурналМашиночитаемыхДоверенностей
	|		ПО Доверенности.Ссылка = ЖурналМашиночитаемыхДоверенностей.Доверенность
	|ГДЕ
	|	Доверенности.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МЧД003.Ссылка,
	|	МЧД003.НомерДоверенности,
	|	МЧД003.НомерРодительскойДоверенности,
	|	ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки,
	|	МЧД003.ФайлМЧД,
	|	МЧД003.ДатаВыдачи,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеДоверители,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеПредставители
	|ИЗ
	|	Справочник.МЧД003 КАК МЧД003
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
	|		ПО МЧД003.Ссылка = ПравилаПроверкиПолномочийПоМЧД.Доверенность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК ЖурналМашиночитаемыхДоверенностей
	|		ПО МЧД003.Ссылка = ЖурналМашиночитаемыхДоверенностей.Доверенность
	|ГДЕ
	|	МЧД003.НомерДоверенности В (&МассивНомеров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МЧД003.Ссылка,
	|	МЧД003.НомерДоверенности,
	|	МЧД003.НомерРодительскойДоверенности,
	|	ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки,
	|	МЧД003.ФайлМЧД,
	|	МЧД003.ДатаВыдачи,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеДоверители,
	|	ЖурналМашиночитаемыхДоверенностей.ВсеПредставители
	|ИЗ
	|	Справочник.МЧД003 КАК МЧД003
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
	|		ПО МЧД003.Ссылка = ПравилаПроверкиПолномочийПоМЧД.Доверенность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК ЖурналМашиночитаемыхДоверенностей
	|		ПО МЧД003.Ссылка = ЖурналМашиночитаемыхДоверенностей.Доверенность
	|ГДЕ
	|	МЧД003.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МассивНомеров", МассивНомеров);
	Запрос.УстановитьПараметр("Ссылка", Доверенность);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НомерДоверенности = "";
	Пока Выборка.НайтиСледующий(НомерДоверенности, "НомерРодительскойДоверенности") Цикл
		НомерДоверенности = Выборка.НомерДоверенности;
		ДобавитьСтрокуВТаблицуДоверенностей(Выборка);
		Выборка.Сбросить();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТаблицуДоверенностей(Выборка)
	
	НоваяСтрока = Доверенности.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	
	Если МашиночитаемыеДоверенности.ЭтоМЧД003(Выборка.Доверенность) Тогда
		ДанныеДоверителей = ОбщегоНазначенияБЭД.JSONЗначение(Выборка.ВсеДоверители);
		ДанныеПредставителей = ОбщегоНазначенияБЭД.JSONЗначение(Выборка.ВсеПредставители);
		
		НоваяСтрока.ОтКого = ПредставлениеСубъектаДляТаблицыДоверенностей(ДанныеДоверителей);
		НоваяСтрока.Кому = ПредставлениеСубъектаДляТаблицыДоверенностей(ДанныеПредставителей);
		НоваяСтрока.Номер = Доверенности.Количество();
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Выборка.XMLфайлМЧД.Получить();
	РезультатЧтения = МашиночитаемыеДоверенности.ДанныеИзФайлаОбмена(ДвоичныеДанные);
	
	Если НЕ РезультатЧтения.Успех Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = РезультатЧтения.ДанныеДоверенности;
	
	Кому = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	ОтКого = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	
	Для Каждого Строка Из СтруктураДанных.ФИО Цикл
		Если Строка.Владелец = Перечисления.СубъектыДоверенности.ДоверительРук
			Или Строка.Владелец = Перечисления.СубъектыДоверенности.ДоверительФЛ Тогда
			ОтКого = Строка;
		КонецЕсли; 
	КонецЦикла;
	
	КомуСтрока = "";
	Для Каждого Представитель Из СтруктураДанных.Представители Цикл
		ЗаполнитьЗначенияСвойств(Кому, Представитель);
		ПредставительОрганизация = ?(Не Представитель.ТипУполномоченногоПредставителя = "ФЛ" 
											И Не СтрЧислоВхождений(КомуСтрока, Представитель.ПредставительЮЛ_НаимОрг),
										Представитель.ПредставительЮЛ_НаимОрг,
										"");
		КомуСтрока = КомуСтрока
					+ ПредставительОрганизация
					+ Символы.ПС
					+ ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Кому)
					+ Символы.ПС;
	КонецЦикла;
	
	ОтКогоСтрока = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОтКого);
	
	Если ЗначениеЗаполнено(СтруктураДанных.ДоверительЮЛ_НаимОрг) Тогда
		ОтКогоСтрока = СтруктураДанных.ДоверительЮЛ_НаимОрг + Символы.ПС + ОтКогоСтрока;
	КонецЕсли;
	
	НоваяСтрока.Кому = КомуСтрока;
	НоваяСтрока.ОтКого = ОтКогоСтрока;
	НоваяСтрока.Номер = Доверенности.Количество();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеСубъектаДляТаблицыДоверенностей(Знач ДанныеСубъекта)

	СубъектыДляПредставления = Новый Массив;
	Для Каждого Субъект Из ДанныеСубъекта Цикл
		СубъектыДляПредставления.Добавить(МашиночитаемыеДоверенности.ПредставлениеСубъектаДоверенности(Субъект));
	КонецЦикла;
	КоличествоСубъектов = СубъектыДляПредставления.Количество();
	Если КоличествоСубъектов > 1 Тогда
		СубъектыДляПредставления[0] = СтрШаблон("[%2] %1", СубъектыДляПредставления[0], КоличествоСубъектов);
	КонецЕсли;

	Возврат СтрСоединить(СубъектыДляПредставления, "; ");
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТабличныйДокументМЧДНаКлиенте()
	
	ЗаполнитьТабличныйДокументМЧД();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументМЧД()
	
	XMLфайлМЧД = МашиночитаемыеДоверенности.ПолныеДанныеДоверенностиНаСервереМЧД(Доверенность);
	РезультатФормирования = МашиночитаемыеДоверенности.ТабличныйДокументМЧД(XMLфайлМЧД, Истина);
	
	Если РезультатФормирования <> Неопределено Тогда
		ПолеПросмотра = РезультатФормирования.ПредставлениеДокумента;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеУточненияПричиныНесоответствияПолномочий(Результат, РезультатПроверки) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		
		РезультатПроверки.ТекстОшибки = Результат;
		Закрыть(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатПроверки));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдресДанныхСертификата()
	Возврат ПоместитьВоВременноеХранилище(Сертификат, УникальныйИдентификатор);
КонецФункции

#КонецОбласти
